In [ ]:
import os

def scale_input_data(scale_factor):
  file_bases = ['./input/OnlineRetail']
  for file_base in file_bases:
    import pandas as pd
    import shutil
    if scale_factor == 1.0:
      shutil.copyfile(file_base + '.csv', file_base + '.scaled.csv')
      continue
    df_to_scale = pd.read_csv(file_base + '.csv', encoding='ISO-8859-1')
    new_num_rows = int(scale_factor * len(df_to_scale))
    if scale_factor <= 1.0:
      df_to_scale = df_to_scale.iloc[:new_num_rows]
    else:
      while len(df_to_scale) < new_num_rows:
        df_to_scale = pd.concat([df_to_scale, df_to_scale[:min(new_num_rows - len(df_to_scale), len(df_to_scale))]])
    df_to_scale.to_csv(file_base + '.scaled.csv', index=False, encoding='ISO-8859-1')

if 'INPUT_SCALE_FACTOR' in os.environ:
  scale_input_data(float(os.environ['INPUT_SCALE_FACTOR']))

In [1]:
import numpy as np
# import pandas as pd
exec(os.environ['IREWR_IMPORTS'])
# FIRST-AUTHOR: remove plotting
# import matplotlib.pyplot as plt
# import seaborn as sns
# %matplotlib inline

In [2]:
df = pd.read_csv('./input/OnlineRetail.scaled.csv', encoding = "ISO-8859-1")

In [3]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [4]:
df=df[['CustomerID', 'InvoiceNo', 'StockCode','Quantity', 'UnitPrice','Description', 'InvoiceDate','Country']]

In [5]:
df.head()

,CustomerID,InvoiceNo,StockCode,Quantity,UnitPrice,Description,InvoiceDate,Country
0,17850.0,536365,85123A,6,2.55,WHITE HANGING HEART T-LIGHT HOLDER,12/1/2010 8:26,United Kingdom
1,17850.0,536365,71053,6,3.39,WHITE METAL LANTERN,12/1/2010 8:26,United Kingdom
2,17850.0,536365,84406B,8,2.75,CREAM CUPID HEARTS COAT HANGER,12/1/2010 8:26,United Kingdom
3,17850.0,536365,84029G,6,3.39,KNITTED UNION FLAG HOT WATER BOTTLE,12/1/2010 8:26,United Kingdom
4,17850.0,536365,84029E,6,3.39,RED WOOLLY HOTTIE WHITE HEART.,12/1/2010 8:26,United Kingdom

In [6]:
df.shape

(541909, 8)

In [7]:
df.isnull().sum()

CustomerID     135080
InvoiceNo           0
StockCode           0
Quantity            0
UnitPrice           0
Description      1454
InvoiceDate         0
Country             0
dtype: int64

**1. What kind of business is this company doing ? **
=> Online retail in 38 countries

In [8]:
df['Country'].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Austria',
       'Israel', 'Finland', 'Bahrain', 'Greece', 'Hong Kong', 'Singapore',
       'Lebanon', 'United Arab Emirates', 'Saudi Arabia',
       'Czech Republic', 'Canada', 'Unspecified', 'Brazil', 'USA',
       'European Community', 'Malta', 'RSA'], dtype=object)

In [9]:
TotalAmount = df['Quantity'] * df['UnitPrice']

df.insert(loc=5, column = 'TotalAmount', value=TotalAmount)

In [10]:
df.head()

,CustomerID,InvoiceNo,StockCode,Quantity,UnitPrice,TotalAmount,Description,InvoiceDate,Country
0,17850.0,536365,85123A,6,2.55,15.30,WHITE HANGING HEART T-LIGHT HOLDER,12/1/2010 8:26,United Kingdom
1,17850.0,536365,71053,6,3.39,20.34,WHITE METAL LANTERN,12/1/2010 8:26,United Kingdom
2,17850.0,536365,84406B,8,2.75,22.00,CREAM CUPID HEARTS COAT HANGER,12/1/2010 8:26,United Kingdom
3,17850.0,536365,84029G,6,3.39,20.34,KNITTED UNION FLAG HOT WATER BOTTLE,12/1/2010 8:26,United Kingdom
4,17850.0,536365,84029E,6,3.39,20.34,RED WOOLLY HOTTIE WHITE HEART.,12/1/2010 8:26,United Kingdom

In [11]:
new_df = df[['CustomerID', 'InvoiceNo', 'StockCode', 'Quantity','TotalAmount', 'InvoiceDate', 'Country']]
new_df2 = df.copy()

In [12]:
new_df.head()

,CustomerID,InvoiceNo,StockCode,Quantity,TotalAmount,InvoiceDate,Country
0,17850.0,536365,85123A,6,15.30,12/1/2010 8:26,United Kingdom
1,17850.0,536365,71053,6,20.34,12/1/2010 8:26,United Kingdom
2,17850.0,536365,84406B,8,22.00,12/1/2010 8:26,United Kingdom
3,17850.0,536365,84029G,6,20.34,12/1/2010 8:26,United Kingdom
4,17850.0,536365,84029E,6,20.34,12/1/2010 8:26,United Kingdom

In [13]:
new_df2.head()

,CustomerID,InvoiceNo,StockCode,Quantity,UnitPrice,TotalAmount,Description,InvoiceDate,Country
0,17850.0,536365,85123A,6,2.55,15.30,WHITE HANGING HEART T-LIGHT HOLDER,12/1/2010 8:26,United Kingdom
1,17850.0,536365,71053,6,3.39,20.34,WHITE METAL LANTERN,12/1/2010 8:26,United Kingdom
2,17850.0,536365,84406B,8,2.75,22.00,CREAM CUPID HEARTS COAT HANGER,12/1/2010 8:26,United Kingdom
3,17850.0,536365,84029G,6,3.39,20.34,KNITTED UNION FLAG HOT WATER BOTTLE,12/1/2010 8:26,United Kingdom
4,17850.0,536365,84029E,6,3.39,20.34,RED WOOLLY HOTTIE WHITE HEART.,12/1/2010 8:26,United Kingdom

In [14]:
country_price = new_df.groupby('Country')['Quantity'].sum().sort_values(ascending = False)
country_price

Country
United Kingdom          4263829
Netherlands              200128
EIRE                     142637
Germany                  117448
France                   110480
Australia                 83653
Sweden                    35637
Switzerland               30325
Spain                     26824
Japan                     25218
Belgium                   23152
Norway                    19247
Portugal                  16180
Finland                   10666
Channel Islands            9479
Denmark                    8188
Italy                      7999
Cyprus                     6317
Singapore                  5234
Austria                    4827
Hong Kong                  4769
Israel                     4353
Poland                     3653
Unspecified                3300
Canada                     2763
Iceland                    2458
Greece                     1556
USA                        1034
United Arab Emirates        982
Malta                       944
Lithuania                   652
Czech Republic              592
European Community          497
Lebanon                     386
Brazil                      356
RSA                         352
Bahrain                     260
Saudi Arabia                 75
Name: Quantity, dtype: int64

In [15]:
country_totalAmount = new_df.groupby('Country')['TotalAmount'].sum().sort_values(ascending=False)
country_totalAmount

Country
United Kingdom          8187806.364
Netherlands              284661.540
EIRE                     263276.820
Germany                  221698.210
France                   197403.900
Australia                137077.270
Switzerland               56385.350
Spain                     54774.580
Belgium                   40910.960
Sweden                    36595.910
Japan                     35340.620
Norway                    35163.460
Portugal                  29367.020
Finland                   22326.740
Channel Islands           20086.290
Denmark                   18768.140
Italy                     16890.510
Cyprus                    12946.290
Austria                   10154.320
Hong Kong                 10117.040
Singapore                  9120.390
Israel                     7907.820
Poland                     7213.140
Unspecified                4749.790
Greece                     4710.520
Iceland                    4310.000
Canada                     3666.380
Malta                      2505.470
United Arab Emirates       1902.280
USA                        1730.920
Lebanon                    1693.880
Lithuania                  1661.060
European Community         1291.750
Brazil                     1143.600
RSA                        1002.310
Czech Republic              707.720
Bahrain                     548.400
Saudi Arabia                131.170
Name: TotalAmount, dtype: float64

In [16]:
# FIRST-AUTHOR: remove plotting
# country_price[:5].plot(kind='bar')
country_price[:5]

Country
United Kingdom    4263829
Netherlands        200128
EIRE               142637
Germany            117448
France             110480
Name: Quantity, dtype: int64

In [17]:
# FIRST-AUTHOR: remove plotting
# country_price[33:].plot(kind='bar')
country_price[33:]

Country
Lebanon         386
Brazil          356
RSA             352
Bahrain         260
Saudi Arabia     75
Name: Quantity, dtype: int64

In [18]:
new_df['Year'] = pd.DatetimeIndex(new_df['InvoiceDate']).year
new_df.head()

/tmp/ipykernel_57282/1532550478.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['Year'] = pd.DatetimeIndex(new_df['InvoiceDate']).year

,CustomerID,InvoiceNo,StockCode,Quantity,TotalAmount,InvoiceDate,Country,Year
0,17850.0,536365,85123A,6,15.30,12/1/2010 8:26,United Kingdom,2010
1,17850.0,536365,71053,6,20.34,12/1/2010 8:26,United Kingdom,2010
2,17850.0,536365,84406B,8,22.00,12/1/2010 8:26,United Kingdom,2010
3,17850.0,536365,84029G,6,20.34,12/1/2010 8:26,United Kingdom,2010
4,17850.0,536365,84029E,6,20.34,12/1/2010 8:26,United Kingdom,2010

In [19]:
# FIRST-AUTHOR: remove plotting
# new_df.groupby('Year')['TotalAmount'].sum().plot(kind='bar')
new_df.groupby('Year')['TotalAmount'].sum()

Year
2010     748957.020
2011    8998790.914
Name: TotalAmount, dtype: float64

In [20]:
new_df.head()

,CustomerID,InvoiceNo,StockCode,Quantity,TotalAmount,InvoiceDate,Country,Year
0,17850.0,536365,85123A,6,15.30,12/1/2010 8:26,United Kingdom,2010
1,17850.0,536365,71053,6,20.34,12/1/2010 8:26,United Kingdom,2010
2,17850.0,536365,84406B,8,22.00,12/1/2010 8:26,United Kingdom,2010
3,17850.0,536365,84029G,6,20.34,12/1/2010 8:26,United Kingdom,2010
4,17850.0,536365,84029E,6,20.34,12/1/2010 8:26,United Kingdom,2010

In [21]:
new_df['Mon'] = pd.DatetimeIndex(new_df['InvoiceDate']).month
new_df['month'] = pd.DatetimeIndex(new_df['InvoiceDate']).month_name
# FIRST-AUTHOR: remove plotting
# new_df.groupby(['Mon', 'Year'])['TotalAmount'].sum().plot(kind='bar', title = 'Sales Moth Wise') 
new_df.groupby(['Mon', 'Year'])['TotalAmount'].sum()

Mon  Year
1    2011     560000.260
2    2011     498062.650
3    2011     683267.080
4    2011     493207.121
5    2011     723333.510
6    2011     691123.120
7    2011     681300.111
8    2011     682680.510
9    2011    1019687.622
10   2011    1070704.670
11   2011    1461756.250
12   2010     748957.020
     2011     433668.010
Name: TotalAmount, dtype: float64

In [22]:
new_df.head()

,CustomerID,InvoiceNo,StockCode,Quantity,TotalAmount,InvoiceDate,Country,Year,Mon,month
0,17850.0,536365,85123A,6,15.30,12/1/2010 8:26,United Kingdom,2010,12,<bound method _inherit_from_data.<locals>.meth...
1,17850.0,536365,71053,6,20.34,12/1/2010 8:26,United Kingdom,2010,12,<bound method _inherit_from_data.<locals>.meth...
2,17850.0,536365,84406B,8,22.00,12/1/2010 8:26,United Kingdom,2010,12,<bound method _inherit_from_data.<locals>.meth...
3,17850.0,536365,84029G,6,20.34,12/1/2010 8:26,United Kingdom,2010,12,<bound method _inherit_from_data.<locals>.meth...
4,17850.0,536365,84029E,6,20.34,12/1/2010 8:26,United Kingdom,2010,12,<bound method _inherit_from_data.<locals>.meth...

In [23]:
new_df=new_df.dropna()

In [24]:
new_df.isnull().sum()

CustomerID     0
InvoiceNo      0
StockCode      0
Quantity       0
TotalAmount    0
InvoiceDate    0
Country        0
Year           0
Mon            0
month          0
dtype: int64

In [25]:
cus_id =  pd.DataFrame(new_df.groupby('Country')['CustomerID'].count().sort_values(ascending = False))
# FIRST-AUTHOR: remove plotting
# cus_id[:5].plot(kind='bar', title='Country with most customers')
cus_id[:5]

                CustomerID
Country
United Kingdom      361878
Germany               9495
France                8491
EIRE                  7485
Spain                 2533

In [26]:
# FIRST-AUTHOR: remove plotting
# cus_id[-5:].plot(kind='bar', title='Least customers for country')
cus_id[-5:]

                CustomerID
Country
Lithuania               35
Brazil                  32
Czech Republic          30
Bahrain                 17
Saudi Arabia            10

In [27]:
new_df2 = new_df2.dropna() 
new_df2.isnull().sum()
new_df2.head()

,CustomerID,InvoiceNo,StockCode,Quantity,UnitPrice,TotalAmount,Description,InvoiceDate,Country
0,17850.0,536365,85123A,6,2.55,15.30,WHITE HANGING HEART T-LIGHT HOLDER,12/1/2010 8:26,United Kingdom
1,17850.0,536365,71053,6,3.39,20.34,WHITE METAL LANTERN,12/1/2010 8:26,United Kingdom
2,17850.0,536365,84406B,8,2.75,22.00,CREAM CUPID HEARTS COAT HANGER,12/1/2010 8:26,United Kingdom
3,17850.0,536365,84029G,6,3.39,20.34,KNITTED UNION FLAG HOT WATER BOTTLE,12/1/2010 8:26,United Kingdom
4,17850.0,536365,84029E,6,3.39,20.34,RED WOOLLY HOTTIE WHITE HEART.,12/1/2010 8:26,United Kingdom

In [28]:
avg_sales = new_df2.groupby(['StockCode','Description'])['Quantity', 'TotalAmount'].mean().sort_values(by='Quantity', ascending = False)
avg_sales

/tmp/ipykernel_57282/139878905.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  avg_sales = new_df2.groupby(['StockCode','Description'])['Quantity', 'TotalAmount'].mean().sort_values(by='Quantity', ascending = False)

                                                  Quantity  TotalAmount
StockCode Description
47556B    TEA TIME TEA TOWELS                  1300.000000  3022.500000
84568     GIRLS ALPHABET IRON ON PATCHES        520.000000    97.200000
84826     ASSTD DESIGN 3D PAPER STICKERS        368.702703     9.145405
18007     ESSENTIAL BALM 3.5g TIN IN ENVELOPE   325.333333    21.320000
20914     SET/5 RED SPOTTY LID GLASS BOWLS      288.000000   734.400000
...                                                    ...          ...
21412     VINTAGE GOLD TINSEL REEL               -6.000000    -2.520000
79323W    WHITE CHERRY LIGHTS                    -8.000000   -54.000000
21144     PINK POODLE HANGING DECORATION        -12.000000    -4.560000
D         Discount                              -15.506494   -73.976883
21645     ASSORTED TUTTI FRUTTI ROUND BOX       -24.000000   -39.600000

[3916 rows x 2 columns]